Autodesk.Revit.DB.Wall.CreateProfileSketch
Creates a new Wall profile Sketch.
Remarks:
The loop of the sketch cannot be obtained until regeneration.
To regenerate the document use Autodesk::Revit::DB::Document::Regenerate().
To edit the Wall profile use Autodesk::Revit::DB::SketchEditScope.
Returns:
Created profile Sketch of the Wall.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Wall does not support profile Sketch as it is not a straight wall; or is tapered;
or it is an old curtain wall; or it is an infill wall; or it is a replacement curtain panel.
-or-
Wall already has a sketch.
Since:
2022